RT-Thread/rt-thread/bsp/at32/libraries/AT32F423_Firmware_Library/drivers/src/at32f423_crm.c
  switch(usart_index)
  {
    case CRM_USART1:
      value = (crm_usart_clock_source_type)CRM->piclks_bit.usart1sel;
      break;
    case CRM_USART2:
      value = (crm_usart_clock_source_type)CRM->piclks_bit.usart2sel;
      break;
    case CRM_USART3:
      value = (crm_usart_clock_source_type)CRM->piclks_bit.usart3sel;
      break;
  }

  return value;
}

/**
  * @brief  i2c multi clock source select
  * @param  i2c_index
  *         this parameter can be one of the following values:
  *         - CRM_I2C1
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_I2C_CLOCK_SOURCE_PCLK
  *         - CRM_I2C_CLOCK_SOURCE_SCLK
  *         - CRM_I2C_CLOCK_SOURCE_HICK
  * @retval none
  */
void crm_i2c_clock_select(crm_i2c_type i2c_index, crm_i2c_clock_source_type value)
{
  switch(i2c_index)
  {
    case CRM_I2C1:
      CRM->piclks_bit.i2c1sel = value;
      break;
  }
}

/**
  * @brief  i2c multi clock source select
  * @param  i2c_index
  *         this parameter can be one of the following values:
  *         - CRM_I2C1
  * @retval crm_i2c_clock_source_type : the clock source of i2c index.
  */
crm_i2c_clock_source_type crm_i2c_clock_get(crm_i2c_type i2c_index)
{
  crm_i2c_clock_source_type value = CRM_I2C_CLOCK_SOURCE_PCLK;

  switch(i2c_index)
  {
    case CRM_I2C1:
      value = (crm_i2c_clock_source_type)CRM->piclks_bit.i2c1sel;
      break;
  }

  return value;
}

/**
  * @brief  adc multi clock source select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_ADC_CLOCK_SOURCE_HCLK
  *         - CRM_ADC_CLOCK_SOURCE_PLLCLK
  * @retval none
  */
void crm_adc_clock_select(crm_adc_clock_source_type value)
{
  CRM->misc1_bit.pllclk_to_adc = value;
}

/**
  * @brief  config hick divider select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_HICK48_DIV6
  *         - CRM_HICK48_NODIV
  * @retval none
  */
void crm_hick_divider_select(crm_hick_div_6_type value)
{
  CRM->misc1_bit.hickdiv = value;
}

/**
  * @brief  hick as system clock frequency select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_HICK_SCLK_8MHZ
  *         - CRM_HICK_SCLK_48MHZ
  * @retval none
  */
void crm_hick_sclk_frequency_select(crm_hick_sclk_frequency_type value)
{
  __IO uint8_t temp_reg = CRM->misc2_bit.hick_to_sclk_div;

  crm_hick_sclk_div_set(CRM_HICK_SCLK_DIV_16);
  /* delay */
  {
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
  }

  CRM->misc1_bit.hick_to_sclk = TRUE;
  crm_hick_divider_select(CRM_HICK48_NODIV);
  CRM->misc1_bit.hick_to_sclk = value;
  crm_hick_sclk_div_set((crm_hick_sclk_div_type)temp_reg);
}

/**
  * @brief  usb 48 mhz clock source select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_USB_CLOCK_SOURCE_PLL
  *         - CRM_USB_CLOCK_SOURCE_HICK
  * @retval none
  */
void crm_usb_clock_source_select(crm_usb_clock_source_type value)
{
  if(value == CRM_USB_CLOCK_SOURCE_HICK)
  {
    crm_hick_sclk_frequency_select(CRM_HICK_SCLK_48MHZ);
  }
  CRM->misc1_bit.hick_to_usb = value;
}

/**
  * @brief  config crm pll
  *                        pll_rcs_freq * pll_ns
  *         pll clock = --------------------------------
  *                           pll_ms * pll_fr_n
  *         attemtion:
  *                  31 <= pll_ns <= 500
  *                  1  <= pll_ms <= 15
  *
  *                       pll_rcs_freq
  *         2mhz <=  ---------------------- <= 16mhz
  *                          pll_ms
  *
  *                       pll_rcs_freq * pll_ns
  *         500mhz <=  -------------------------------- <= 1000mhz
  *                               pll_ms
  * @param  clock_source
  *         this parameter can be one of the following values:
  *         - CRM_PLL_SOURCE_HICK
  *         - CRM_PLL_SOURCE_HEXT
  * @param  pll_ns (31~500)
  * @param  pll_ms (1~15)
  * @param  pll_fr
  *         this parameter can be one of the following values:
  *         - CRM_PLL_FR_1
  *         - CRM_PLL_FR_2
  *         - CRM_PLL_FR_4
  *         - CRM_PLL_FR_8
  *         - CRM_PLL_FR_16
  *         - CRM_PLL_FR_32
  * @retval none
  */
void crm_pll_config(crm_pll_clock_source_type clock_source, uint16_t pll_ns, \
                    uint16_t pll_ms, crm_pll_fr_type pll_fr)
{
  /* config pll clock source */
  if(clock_source == CRM_PLL_SOURCE_HICK)
  {
    CRM->misc1_bit.hickdiv = CRM_HICK48_NODIV;
  }
  CRM->pllcfg_bit.pllrcs = clock_source;

  /* config pll multiplication factor */
  CRM->pllcfg_bit.pllns = pll_ns;
  CRM->pllcfg_bit.pllms = pll_ms;
  CRM->pllcfg_bit.pllfr = pll_fr;
}

/**
  * @brief  select system clock source
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_SCLK_HICK
  *         - CRM_SCLK_HEXT
  *         - CRM_SCLK_PLL
  * @retval none
  */
void crm_sysclk_switch(crm_sclk_type value)
{
  /* enable auto step mode */
  crm_auto_step_mode_enable(TRUE);

  CRM->cfg_bit.sclksel = value;

  /* disable auto step mode */
  crm_auto_step_mode_enable(FALSE);
}

/**
  * @brief  indicate which clock source is used as system clock
  * @param  none
  * @retval crm_sclk
  *         this return can be one of the following values:
  *         - CRM_SCLK_HICK
  *         - CRM_SCLK_HEXT
  *         - CRM_SCLK_PLL
  */
crm_sclk_type crm_sysclk_switch_status_get(void)
{
  return (crm_sclk_type)CRM->cfg_bit.sclksts;
}

/**
  * @brief  get crm clocks freqency
  * @param  clocks_struct
  *         - pointer to the crm_clocks_freq_type structure
  * @retval none
  */
void crm_clocks_freq_get(crm_clocks_freq_type *clocks_struct)
{
  uint32_t pll_ns = 0, pll_ms = 0, pll_fr = 0, pll_clock_source = 0, pllrcsfreq = 0;
  uint32_t temp = 0, div_value = 0;
  crm_sclk_type sclk_source;

